TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/гкс_ВремяНахожденияТСНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВремяНахожденияТСНаПЛК</name>
  <resources>
    <name>ВремяВзвешенБрутто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВзвешенТара</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОтклонение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПЛК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаАвтоПеревозки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль;
	РазрешитьВходнойКонтрольДоВзвешивания = гкс_ПриемкаТранспорта.
		РазрешитьВходнойКонтрольДоВзвешивания(ОтборТипРегистрации, ОтборВидПеревозки);
	
	ИнициализироватьРеквизитыФормы();
	ИнициализироватьЭлементыФормы();
	УстановитьВидимостьДоступностьЭлементовФормы();
	УстановитьВидимостьЭлементовСпискаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ОтборТочкаМаршрута) Тогда
		
		ШаблонСообщения = НСтр("ru = 'Не определена рабочая точка маршрута! %1'"); 
		Если ИспользоватьНесколькоАЛЦ Тогда
			ТекстУточнениея = НСтр("ru = 'Проверьте ""Настройки ролей пользователей приемки транспорта""'");
		Иначе
			ТекстУточнениея = НСтр("ru = 'Проверьте константу ""Точка маршрута базы""'");
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстУточнениея);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ОтборТочкаМаршрута");
		ТолькоПросмотр = Истина;
		
	Иначе
		УстановитьОтборыСпискаРегистрации();
		УстановитьВидимостьДоступностьКомандФормы();
		ПодключитьОбработчикОжиданияОбновления(Истина, Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборТочкаМаршрутаПриИзменении(Элемент)
	
	ПриИзмененииФильтра();
	ОтборТочкаМаршрутаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРегистрацииПриИзменении(Элемент)

	ПриИзмененииФильтра();
	УстановитьЗаголовкиЭлементовПоТипуРегистрации(ОтборТипРегистрации);
	УстановитьВидимостьДоступностьКомандФормы();
	УстановитьВидимостьЭлементовСпискаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	ПриИзмененииФильтра();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТранспортПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборТранспорт) Тогда
		ОтборНомерТС = "";
	КонецЕсли;
	
	ПриИзмененииФильтра();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрНомерТСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборНомерТС) Тогда
		ОтборТранспорт = Неопределено;
	КонецЕсли;
	
	ПриИзмененииФильтра();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегистрации

&НаКлиенте
Процедура СписокРегистрацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокРегистрацииПометка Тогда	
		
		ТекущиеДанные.Пометка = Не ТекущиеДанные.Пометка;
		УстановитьПометку(ТекущиеДанные.Пометка, ТекущиеДанные.ДокументРегистрации);
		
	ИначеЕсли Поле = Элементы.СписокРегистрацииНомер Тогда 	
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.ДокументРегистрации);
		
	ИначеЕсли Поле = Элементы.СписокРегистрацииДоговор Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.Спецификация);
		
	ИначеЕсли Поле = Элементы.СписокРегистрацииГруппа Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.Группа);
		
	Иначе
		Возврат; // Исправление замечаний SonarQube
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокРегистрацииПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжиданияОбновления(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьРегистрациюКПП(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ДобавитьРегистрациюНаОсновании", ЭтотОбъект);
	ОткрытьФорму(
		"Обработка.гкс_ПриемкаТранспорта.Форма.ФормаВыбораОснованияРегистрации",, 
		ЭтотОбъект,,,, 
		ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	УстановитьПометку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	УстановитьПометку(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициалиализация

&НаСервере
Процедура ИнициализироватьЭлементыФормы()
	
	ОбновитьНаправленияРазгрузки();

КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ИнициализироватьЗаголовокФормы();
	ИнициализироватьТекущегоПользователя();
	ИнициализироватьРеквизитыОтбора();
	ИнициализироватьСтруктуруДоступов();
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьРеквизитыПравПользователя(ЭтотОбъект);
	
	ИнициализироватьРеквизитыВремяОжиданияТС();
	ИнициализироватьАвтоматическоеФормированиеДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗаголовокФормы()
	
	Если Параметры.Свойство("АвтоПриемка") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Рабочее место ""Приемка и отгрузка на ПЛК"": Авто транспорт'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТекущегоПользователя()
	
	Пользователь = Пользователи.ТекущийПользователь();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
КонецПроцедуры
 
&НаСервере
Процедура ИнициализироватьРеквизитыОтбора()
	
	Если Параметры.Свойство("АвтоПриемка") Тогда
		ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка;
	КонецЕсли;
	
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьОтборТочкаМаршрута(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруДоступов()
	
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьСтруктуруДоступов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыВремяОжиданияТС()
	
	Если ЗначениеЗаполнено(ОтборТочкаМаршрута) Тогда
		ЧасовойПоясПЛК = гкс_ПриемкаТранспортаВызовСервера.ЧасовойПоясПЛК(ОтборТочкаМаршрута);
	КонецЕсли;
	
КонецПроцедуры
  
&НаСервере
Процедура ИнициализироватьАвтоматическоеФормированиеДокументов()
	
	АвтоматическоеФормированиеДокументов = 
		гкс_РаботаСНастройками.ЕстьАвтоматическоеФормированиеДокументовДляТочкиМаршрута(ОтборТочкаМаршрута);

КонецПроцедуры

#КонецОбласти 

#Область ВидимостьДоступность

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	УстановитьВидимостьДоступностьИныхЭлемнотовФормы();
	УстановитьВидимостьДоступностьПринятыеТС();

КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьВидимостьДоступностьКомандФормы()
	
	Элементы.СписокРегистрацииКПП.Видимость = 
		ЕстьПравоНаРедактированиеРегистрации Или ЭтоПолноправныйПользователь;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьВидимостьДоступностьКомандФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовСпискаРегистрации()
	
	Элементы.СписокРегистрацииТочкаМаршрута.Видимость = Не ЗначениеЗаполнено(ОтборТочкаМаршрута);
	Элементы.СписокРегистрацииЕстьОтклонениеПоВремени.Видимость =
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.УчитыватьВремяНахожденияТС(
			ОтборТипРегистрации, ОтборВидПеревозки, ОтборТочкаМаршрута);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьИныхЭлемнотовФормы()
	
	УстановленОтборТочкаМаршрута 	= ЗначениеЗаполнено(ОтборТочкаМаршрута);
	УстановленОтборВидПеревозки 	= ЗначениеЗаполнено(ОтборВидПеревозки);
			
	Элементы.ГруппаОсновная.Видимость 	= УстановленОтборТочкаМаршрута И УстановленОтборВидПеревозки; 
	Элементы.ГруппаГлавная.Видимость 	= УстановленОтборТочкаМаршрута И УстановленОтборВидПеревозки;
		
	Элементы.КачественныеПоказателиУсиленныйКонтроль.Видимость 
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества");
		
	Элементы.СписокРегистрацииЗаблокировано.Видимость 
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС");
			
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьПринятыеТС()
	
	ЕстьПравоНаЗПП3 = ЕстьПравоНаРедактирование("гкс_РеестрНакладныхЗПП3");
	
	Элементы.ГруппаПринятыеТС.Видимость = ЕстьПравоНаЗПП3;
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПриИзмененииФильтра()
	УстановитьОтборыСпискаРегистрации();
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Пометка, РегистрацияНаПЛК = Неопределено)

	Если ЗначениеЗаполнено(РегистрацияНаПЛК) Тогда // Единичный выбор в списке
		
		гкс_ПриемкаТранспортаСлужебныйКлиент.ОбработатьИзменениеПометкиДляОднойСтроки(
			Пометка, РегистрацииВыбранные, РегистрацияНаПЛК);
		
	Иначе
		
		Если Пометка Тогда 
			РегистрацииГрупповойОбработки = РегистрацииГрупповойОбработки();
			РегистрацииВыбранные.ЗагрузитьЗначения(РегистрацииГрупповойОбработки);
		Иначе 
			РегистрацииВыбранные.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжиданияОбновления(Истина, Истина);

КонецПроцедуры

#Область ОбратныеВызовы

&НаКлиенте
Процедура НастройкаЯмРазгрузки_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьНаправленияРазгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРегистрациюНаОсновании(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		
		ЗначенияЗаполнения = гкс_ПриемкаТранспортаСлужебныйКлиент.ЗначенияЗаполненияРегистрацииНаПЛК(ЭтотОбъект);
		ЗначенияЗаполнения.Вставить("ДокументОснование", Результат);
		
		гкс_ПриемкаТранспортаСлужебныйКлиент.ОткрытьФормуНовогоДокументаРегистрацияНаПЛК(
			ЭтотОбъект, ЗначенияЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

// Подключает/отключает обработчик ожидания для обновления списка.
//
// Параметры:
//	Подключать - Булево - если Ложь, то обработчик ожидания будет отключен
//	Однократно - Булево - признак однократного выполнения обработчика
//
&НаКлиенте
Процедура ПодключитьОбработчикОжиданияОбновления(Подключать = Истина, Однократно = Истина)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ПодключитьОбработчикОжиданияОбновления(ЭтотОбъект, Подключать, Однократно);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеДоступностиКомандУправленияРегистрациейПоТекущемуСостоянию

&НаКлиенте
Процедура ОбновитьКнопки(ТекущиеДанные)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьДоступностьКнопокУправленияПоУмолчанию(ЭтотОбъект);
	Если Не (ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Состояние")) Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ОбновитьКнопки(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды 
// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Элементы.СписокРегистрации.ТекущиеДанные <> Неопределено Тогда
		
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, 
			Элементы.СписокРегистрации.ТекущиеДанные.ДокументРегистрации);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокРегистрации);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

#Область Заметки

&НаСервере
Процедура ОбновитьНаправленияРазгрузки()
	
	гкс_ПриемкаТранспортаСлужебный.ОбновитьНаправленияРазгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПоказатьЗначениеВДиалоге(Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(Неопределено, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеНаФорме()
	
	ОбновитьПараметрыСпискаРегистраций();
	Элементы.СписокРегистрации.Обновить();
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Если ТекущиеДанные.Свойство("ТипРегистрации")
		И Не ОтборТипРегистрации = ТекущиеДанные.ТипРегистрации Тогда
			
		УстановитьЗаголовкиЭлементовПоТипуРегистрации(ТекущиеДанные.ТипРегистрации);
	КонецЕсли;
	
	ОбновитьКнопки(ТекущиеДанные);
	
	Подключаемый_ОбновитьДетальныеЗаписиРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыСпискаРегистраций()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРегистрации, 
		"РегистрацииВыбранные", РегистрацииВыбранные.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиЭлементовПоТипуРегистрации(ТипРегистрацииТранспорта)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьЗаголовкиЭлементовПоТипуРегистрации(
		ЭтотОбъект, ТипРегистрацииТранспорта);
	
КонецПроцедуры

#Область РаботаСОкномДетальныеЗаписиРегистраций

&НаКлиенте
Процедура Подключаемый_ОбновитьДетальныеЗаписиРегистрации()
	
	Если Не РежимПросмотраДетальныхЗаписей Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ТекущиеДанные)
	
	гкс_ПриемкаТранспортаСлужебный.ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьОтборыСпискаРегистрации()
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьОбщиеОтборыСпискаРегистрации(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ЕстьПравоНаРедактирование(ИмяОбъекта)
	
	Возврат ПравоДоступа("Добавление", Метаданные.Документы[ИмяОбъекта]);
	
КонецФункции

&НаСервере
Процедура ОтборТочкаМаршрутаПриИзмененииНаСервере()
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	УстановитьВидимостьЭлементовСпискаРегистрации();
	ИнициализироватьРеквизитыВремяОжиданияТС();
	ИнициализироватьАвтоматическоеФормированиеДокументов();
	
	ОбновитьНаправленияРазгрузки();
	
КонецПроцедуры

&НаСервере
Функция РегистрацииГрупповойОбработки()
	Возврат гкс_ПриемкаТранспортаСлужубныйВызовСервера.РегистрацииГрупповойОбработки(ЭтотОбъект);
КонецФункции

#КонецОбласти
